zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_MU.h
#define MU_FCR_F8_MASK                           (0x100U)
#define MU_FCR_F8_SHIFT                          (8U)
/*! F8 - MUB to MUA Flag n
 *  0b0..Clears the Fn bit in the FSR register.
 *  0b1..Sets the Fn bit in the FSR register.
 */
#define MU_FCR_F8(x)                             (((uint32_t)(((uint32_t)(x)) << MU_FCR_F8_SHIFT)) & MU_FCR_F8_MASK)

#define MU_FCR_F9_MASK                           (0x200U)
#define MU_FCR_F9_SHIFT                          (9U)
/*! F9 - MUB to MUA Flag n
 *  0b0..Clears the Fn bit in the FSR register.
 *  0b1..Sets the Fn bit in the FSR register.
 */
#define MU_FCR_F9(x)                             (((uint32_t)(((uint32_t)(x)) << MU_FCR_F9_SHIFT)) & MU_FCR_F9_MASK)

#define MU_FCR_F10_MASK                          (0x400U)
#define MU_FCR_F10_SHIFT                         (10U)
/*! F10 - MUB to MUA Flag n
 *  0b0..Clears the Fn bit in the FSR register.
 *  0b1..Sets the Fn bit in the FSR register.
 */
#define MU_FCR_F10(x)                            (((uint32_t)(((uint32_t)(x)) << MU_FCR_F10_SHIFT)) & MU_FCR_F10_MASK)

#define MU_FCR_F11_MASK                          (0x800U)
#define MU_FCR_F11_SHIFT                         (11U)
/*! F11 - MUB to MUA Flag n
 *  0b0..Clears the Fn bit in the FSR register.
 *  0b1..Sets the Fn bit in the FSR register.
 */
#define MU_FCR_F11(x)                            (((uint32_t)(((uint32_t)(x)) << MU_FCR_F11_SHIFT)) & MU_FCR_F11_MASK)

#define MU_FCR_F12_MASK                          (0x1000U)
#define MU_FCR_F12_SHIFT                         (12U)
/*! F12 - MUB to MUA Flag n
 *  0b0..Clears the Fn bit in the FSR register.
 *  0b1..Sets the Fn bit in the FSR register.
 */
#define MU_FCR_F12(x)                            (((uint32_t)(((uint32_t)(x)) << MU_FCR_F12_SHIFT)) & MU_FCR_F12_MASK)

#define MU_FCR_F13_MASK                          (0x2000U)
#define MU_FCR_F13_SHIFT                         (13U)
/*! F13 - MUB to MUA Flag n
 *  0b0..Clears the Fn bit in the FSR register.
 *  0b1..Sets the Fn bit in the FSR register.
 */
#define MU_FCR_F13(x)                            (((uint32_t)(((uint32_t)(x)) << MU_FCR_F13_SHIFT)) & MU_FCR_F13_MASK)

#define MU_FCR_F14_MASK                          (0x4000U)
#define MU_FCR_F14_SHIFT                         (14U)
/*! F14 - MUB to MUA Flag n
 *  0b0..Clears the Fn bit in the FSR register.
 *  0b1..Sets the Fn bit in the FSR register.
 */
#define MU_FCR_F14(x)                            (((uint32_t)(((uint32_t)(x)) << MU_FCR_F14_SHIFT)) & MU_FCR_F14_MASK)

#define MU_FCR_F15_MASK                          (0x8000U)
#define MU_FCR_F15_SHIFT                         (15U)
/*! F15 - MUB to MUA Flag n
 *  0b0..Clears the Fn bit in the FSR register.
 *  0b1..Sets the Fn bit in the FSR register.
 */
#define MU_FCR_F15(x)                            (((uint32_t)(((uint32_t)(x)) << MU_FCR_F15_SHIFT)) & MU_FCR_F15_MASK)

#define MU_FCR_F16_MASK                          (0x10000U)
#define MU_FCR_F16_SHIFT                         (16U)
/*! F16 - MUB to MUA Flag n
 *  0b0..Clears the Fn bit in the FSR register.
 *  0b1..Sets the Fn bit in the FSR register.
 */
#define MU_FCR_F16(x)                            (((uint32_t)(((uint32_t)(x)) << MU_FCR_F16_SHIFT)) & MU_FCR_F16_MASK)

#define MU_FCR_F17_MASK                          (0x20000U)
#define MU_FCR_F17_SHIFT                         (17U)
/*! F17 - MUB to MUA Flag n
 *  0b0..Clears the Fn bit in the FSR register.
 *  0b1..Sets the Fn bit in the FSR register.
 */
#define MU_FCR_F17(x)                            (((uint32_t)(((uint32_t)(x)) << MU_FCR_F17_SHIFT)) & MU_FCR_F17_MASK)

#define MU_FCR_F18_MASK                          (0x40000U)
#define MU_FCR_F18_SHIFT                         (18U)
/*! F18 - MUB to MUA Flag n
 *  0b0..Clears the Fn bit in the FSR register.
 *  0b1..Sets the Fn bit in the FSR register.
 */
#define MU_FCR_F18(x)                            (((uint32_t)(((uint32_t)(x)) << MU_FCR_F18_SHIFT)) & MU_FCR_F18_MASK)

#define MU_FCR_F19_MASK                          (0x80000U)
#define MU_FCR_F19_SHIFT                         (19U)
/*! F19 - MUB to MUA Flag n
 *  0b0..Clears the Fn bit in the FSR register.
 *  0b1..Sets the Fn bit in the FSR register.
 */
#define MU_FCR_F19(x)                            (((uint32_t)(((uint32_t)(x)) << MU_FCR_F19_SHIFT)) & MU_FCR_F19_MASK)

#define MU_FCR_F20_MASK                          (0x100000U)
#define MU_FCR_F20_SHIFT                         (20U)
/*! F20 - MUB to MUA Flag n
 *  0b0..Clears the Fn bit in the FSR register.
 *  0b1..Sets the Fn bit in the FSR register.
 */
#define MU_FCR_F20(x)                            (((uint32_t)(((uint32_t)(x)) << MU_FCR_F20_SHIFT)) & MU_FCR_F20_MASK)

#define MU_FCR_F21_MASK                          (0x200000U)
#define MU_FCR_F21_SHIFT                         (21U)
/*! F21 - MUB to MUA Flag n
 *  0b0..Clears the Fn bit in the FSR register.
 *  0b1..Sets the Fn bit in the FSR register.
 */
#define MU_FCR_F21(x)                            (((uint32_t)(((uint32_t)(x)) << MU_FCR_F21_SHIFT)) & MU_FCR_F21_MASK)

#define MU_FCR_F22_MASK                          (0x400000U)
#define MU_FCR_F22_SHIFT                         (22U)
/*! F22 - MUB to MUA Flag n
 *  0b0..Clears the Fn bit in the FSR register.
 *  0b1..Sets the Fn bit in the FSR register.
 */
#define MU_FCR_F22(x)                            (((uint32_t)(((uint32_t)(x)) << MU_FCR_F22_SHIFT)) & MU_FCR_F22_MASK)

#define MU_FCR_F23_MASK                          (0x800000U)
#define MU_FCR_F23_SHIFT                         (23U)
/*! F23 - MUB to MUA Flag n
 *  0b0..Clears the Fn bit in the FSR register.
 *  0b1..Sets the Fn bit in the FSR register.
 */
#define MU_FCR_F23(x)                            (((uint32_t)(((uint32_t)(x)) << MU_FCR_F23_SHIFT)) & MU_FCR_F23_MASK)

#define MU_FCR_F24_MASK                          (0x1000000U)
#define MU_FCR_F24_SHIFT                         (24U)
/*! F24 - MUB to MUA Flag n
 *  0b0..Clears the Fn bit in the FSR register.
 *  0b1..Sets the Fn bit in the FSR register.
 */
#define MU_FCR_F24(x)                            (((uint32_t)(((uint32_t)(x)) << MU_FCR_F24_SHIFT)) & MU_FCR_F24_MASK)

