zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_MU.h
#define MU_FSR_F11_MASK                          (0x800U)
#define MU_FSR_F11_SHIFT                         (11U)
/*! F11 - MUA to MUB Side Flag n
 *  0b0..Fn bit in the MUA FCR register is written 0.
 *  0b1..Fn bit in the MUA FCR register is written 1.
 */
#define MU_FSR_F11(x)                            (((uint32_t)(((uint32_t)(x)) << MU_FSR_F11_SHIFT)) & MU_FSR_F11_MASK)

#define MU_FSR_F12_MASK                          (0x1000U)
#define MU_FSR_F12_SHIFT                         (12U)
/*! F12 - MUA to MUB Side Flag n
 *  0b0..Fn bit in the MUA FCR register is written 0.
 *  0b1..Fn bit in the MUA FCR register is written 1.
 */
#define MU_FSR_F12(x)                            (((uint32_t)(((uint32_t)(x)) << MU_FSR_F12_SHIFT)) & MU_FSR_F12_MASK)

#define MU_FSR_F13_MASK                          (0x2000U)
#define MU_FSR_F13_SHIFT                         (13U)
/*! F13 - MUA to MUB Side Flag n
 *  0b0..Fn bit in the MUA FCR register is written 0.
 *  0b1..Fn bit in the MUA FCR register is written 1.
 */
#define MU_FSR_F13(x)                            (((uint32_t)(((uint32_t)(x)) << MU_FSR_F13_SHIFT)) & MU_FSR_F13_MASK)

#define MU_FSR_F14_MASK                          (0x4000U)
#define MU_FSR_F14_SHIFT                         (14U)
/*! F14 - MUA to MUB Side Flag n
 *  0b0..Fn bit in the MUA FCR register is written 0.
 *  0b1..Fn bit in the MUA FCR register is written 1.
 */
#define MU_FSR_F14(x)                            (((uint32_t)(((uint32_t)(x)) << MU_FSR_F14_SHIFT)) & MU_FSR_F14_MASK)

#define MU_FSR_F15_MASK                          (0x8000U)
#define MU_FSR_F15_SHIFT                         (15U)
/*! F15 - MUA to MUB Side Flag n
 *  0b0..Fn bit in the MUA FCR register is written 0.
 *  0b1..Fn bit in the MUA FCR register is written 1.
 */
#define MU_FSR_F15(x)                            (((uint32_t)(((uint32_t)(x)) << MU_FSR_F15_SHIFT)) & MU_FSR_F15_MASK)

#define MU_FSR_F16_MASK                          (0x10000U)
#define MU_FSR_F16_SHIFT                         (16U)
/*! F16 - MUA to MUB Side Flag n
 *  0b0..Fn bit in the MUA FCR register is written 0.
 *  0b1..Fn bit in the MUA FCR register is written 1.
 */
#define MU_FSR_F16(x)                            (((uint32_t)(((uint32_t)(x)) << MU_FSR_F16_SHIFT)) & MU_FSR_F16_MASK)

#define MU_FSR_F17_MASK                          (0x20000U)
#define MU_FSR_F17_SHIFT                         (17U)
/*! F17 - MUA to MUB Side Flag n
 *  0b0..Fn bit in the MUA FCR register is written 0.
 *  0b1..Fn bit in the MUA FCR register is written 1.
 */
#define MU_FSR_F17(x)                            (((uint32_t)(((uint32_t)(x)) << MU_FSR_F17_SHIFT)) & MU_FSR_F17_MASK)

#define MU_FSR_F18_MASK                          (0x40000U)
#define MU_FSR_F18_SHIFT                         (18U)
/*! F18 - MUA to MUB Side Flag n
 *  0b0..Fn bit in the MUA FCR register is written 0.
 *  0b1..Fn bit in the MUA FCR register is written 1.
 */
#define MU_FSR_F18(x)                            (((uint32_t)(((uint32_t)(x)) << MU_FSR_F18_SHIFT)) & MU_FSR_F18_MASK)

#define MU_FSR_F19_MASK                          (0x80000U)
#define MU_FSR_F19_SHIFT                         (19U)
/*! F19 - MUA to MUB Side Flag n
 *  0b0..Fn bit in the MUA FCR register is written 0.
 *  0b1..Fn bit in the MUA FCR register is written 1.
 */
#define MU_FSR_F19(x)                            (((uint32_t)(((uint32_t)(x)) << MU_FSR_F19_SHIFT)) & MU_FSR_F19_MASK)

#define MU_FSR_F20_MASK                          (0x100000U)
#define MU_FSR_F20_SHIFT                         (20U)
/*! F20 - MUA to MUB Side Flag n
 *  0b0..Fn bit in the MUA FCR register is written 0.
 *  0b1..Fn bit in the MUA FCR register is written 1.
 */
#define MU_FSR_F20(x)                            (((uint32_t)(((uint32_t)(x)) << MU_FSR_F20_SHIFT)) & MU_FSR_F20_MASK)

#define MU_FSR_F21_MASK                          (0x200000U)
#define MU_FSR_F21_SHIFT                         (21U)
/*! F21 - MUA to MUB Side Flag n
 *  0b0..Fn bit in the MUA FCR register is written 0.
 *  0b1..Fn bit in the MUA FCR register is written 1.
 */
#define MU_FSR_F21(x)                            (((uint32_t)(((uint32_t)(x)) << MU_FSR_F21_SHIFT)) & MU_FSR_F21_MASK)

#define MU_FSR_F22_MASK                          (0x400000U)
#define MU_FSR_F22_SHIFT                         (22U)
/*! F22 - MUA to MUB Side Flag n
 *  0b0..Fn bit in the MUA FCR register is written 0.
 *  0b1..Fn bit in the MUA FCR register is written 1.
 */
#define MU_FSR_F22(x)                            (((uint32_t)(((uint32_t)(x)) << MU_FSR_F22_SHIFT)) & MU_FSR_F22_MASK)

#define MU_FSR_F23_MASK                          (0x800000U)
#define MU_FSR_F23_SHIFT                         (23U)
/*! F23 - MUA to MUB Side Flag n
 *  0b0..Fn bit in the MUA FCR register is written 0.
 *  0b1..Fn bit in the MUA FCR register is written 1.
 */
#define MU_FSR_F23(x)                            (((uint32_t)(((uint32_t)(x)) << MU_FSR_F23_SHIFT)) & MU_FSR_F23_MASK)

#define MU_FSR_F24_MASK                          (0x1000000U)
#define MU_FSR_F24_SHIFT                         (24U)
/*! F24 - MUA to MUB Side Flag n
 *  0b0..Fn bit in the MUA FCR register is written 0.
 *  0b1..Fn bit in the MUA FCR register is written 1.
 */
#define MU_FSR_F24(x)                            (((uint32_t)(((uint32_t)(x)) << MU_FSR_F24_SHIFT)) & MU_FSR_F24_MASK)

#define MU_FSR_F25_MASK                          (0x2000000U)
#define MU_FSR_F25_SHIFT                         (25U)
/*! F25 - MUA to MUB Side Flag n
 *  0b0..Fn bit in the MUA FCR register is written 0.
 *  0b1..Fn bit in the MUA FCR register is written 1.
 */
#define MU_FSR_F25(x)                            (((uint32_t)(((uint32_t)(x)) << MU_FSR_F25_SHIFT)) & MU_FSR_F25_MASK)

#define MU_FSR_F26_MASK                          (0x4000000U)
#define MU_FSR_F26_SHIFT                         (26U)
/*! F26 - MUA to MUB Side Flag n
 *  0b0..Fn bit in the MUA FCR register is written 0.
 *  0b1..Fn bit in the MUA FCR register is written 1.
 */
#define MU_FSR_F26(x)                            (((uint32_t)(((uint32_t)(x)) << MU_FSR_F26_SHIFT)) & MU_FSR_F26_MASK)

#define MU_FSR_F27_MASK                          (0x8000000U)
#define MU_FSR_F27_SHIFT                         (27U)
/*! F27 - MUA to MUB Side Flag n
 *  0b0..Fn bit in the MUA FCR register is written 0.
 *  0b1..Fn bit in the MUA FCR register is written 1.
 */
#define MU_FSR_F27(x)                            (((uint32_t)(((uint32_t)(x)) << MU_FSR_F27_SHIFT)) & MU_FSR_F27_MASK)

