zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_MU.h
#define MU_FSR_F28_MASK                          (0x10000000U)
#define MU_FSR_F28_SHIFT                         (28U)
/*! F28 - MUA to MUB Side Flag n
 *  0b0..Fn bit in the MUA FCR register is written 0.
 *  0b1..Fn bit in the MUA FCR register is written 1.
 */
#define MU_FSR_F28(x)                            (((uint32_t)(((uint32_t)(x)) << MU_FSR_F28_SHIFT)) & MU_FSR_F28_MASK)

#define MU_FSR_F29_MASK                          (0x20000000U)
#define MU_FSR_F29_SHIFT                         (29U)
/*! F29 - MUA to MUB Side Flag n
 *  0b0..Fn bit in the MUA FCR register is written 0.
 *  0b1..Fn bit in the MUA FCR register is written 1.
 */
#define MU_FSR_F29(x)                            (((uint32_t)(((uint32_t)(x)) << MU_FSR_F29_SHIFT)) & MU_FSR_F29_MASK)

#define MU_FSR_F30_MASK                          (0x40000000U)
#define MU_FSR_F30_SHIFT                         (30U)
/*! F30 - MUA to MUB Side Flag n
 *  0b0..Fn bit in the MUA FCR register is written 0.
 *  0b1..Fn bit in the MUA FCR register is written 1.
 */
#define MU_FSR_F30(x)                            (((uint32_t)(((uint32_t)(x)) << MU_FSR_F30_SHIFT)) & MU_FSR_F30_MASK)

#define MU_FSR_F31_MASK                          (0x80000000U)
#define MU_FSR_F31_SHIFT                         (31U)
/*! F31 - MUA to MUB Side Flag n
 *  0b0..Fn bit in the MUA FCR register is written 0.
 *  0b1..Fn bit in the MUA FCR register is written 1.
 */
#define MU_FSR_F31(x)                            (((uint32_t)(((uint32_t)(x)) << MU_FSR_F31_SHIFT)) & MU_FSR_F31_MASK)
/*! @} */

/*! @name GIER - General Interrupt Enable Register */
/*! @{ */

#define MU_GIER_GIE0_MASK                        (0x1U)
#define MU_GIER_GIE0_SHIFT                       (0U)
/*! GIE0 - MUB General Purpose Interrupt Enable n
 *  0b0..Disables MUA General Interrupt n.
 *  0b1..Enables MUA General Interrupt n.
 */
#define MU_GIER_GIE0(x)                          (((uint32_t)(((uint32_t)(x)) << MU_GIER_GIE0_SHIFT)) & MU_GIER_GIE0_MASK)

#define MU_GIER_GIE1_MASK                        (0x2U)
#define MU_GIER_GIE1_SHIFT                       (1U)
/*! GIE1 - MUB General Purpose Interrupt Enable n
 *  0b0..Disables MUB General Interrupt n.
 *  0b1..Enables MUB General Interrupt n.
 */
#define MU_GIER_GIE1(x)                          (((uint32_t)(((uint32_t)(x)) << MU_GIER_GIE1_SHIFT)) & MU_GIER_GIE1_MASK)

#define MU_GIER_GIE2_MASK                        (0x4U)
#define MU_GIER_GIE2_SHIFT                       (2U)
/*! GIE2 - MUB General Purpose Interrupt Enable n
 *  0b0..Disables MUB General Interrupt n.
 *  0b1..Enables MUB General Interrupt n.
 */
#define MU_GIER_GIE2(x)                          (((uint32_t)(((uint32_t)(x)) << MU_GIER_GIE2_SHIFT)) & MU_GIER_GIE2_MASK)

#define MU_GIER_GIE3_MASK                        (0x8U)
#define MU_GIER_GIE3_SHIFT                       (3U)
/*! GIE3 - MUB General Purpose Interrupt Enable n
 *  0b0..Disables MUB General Interrupt n.
 *  0b1..Enables MUB General Interrupt n.
 */
#define MU_GIER_GIE3(x)                          (((uint32_t)(((uint32_t)(x)) << MU_GIER_GIE3_SHIFT)) & MU_GIER_GIE3_MASK)

#define MU_GIER_GIE4_MASK                        (0x10U)
#define MU_GIER_GIE4_SHIFT                       (4U)
/*! GIE4 - MUB General Purpose Interrupt Enable n
 *  0b0..Disables MUB General Interrupt n.
 *  0b1..Enables MUB General Interrupt n.
 */
#define MU_GIER_GIE4(x)                          (((uint32_t)(((uint32_t)(x)) << MU_GIER_GIE4_SHIFT)) & MU_GIER_GIE4_MASK)

#define MU_GIER_GIE5_MASK                        (0x20U)
#define MU_GIER_GIE5_SHIFT                       (5U)
/*! GIE5 - MUB General Purpose Interrupt Enable n
 *  0b0..Disables MUB General Interrupt n.
 *  0b1..Enables MUB General Interrupt n.
 */
#define MU_GIER_GIE5(x)                          (((uint32_t)(((uint32_t)(x)) << MU_GIER_GIE5_SHIFT)) & MU_GIER_GIE5_MASK)

#define MU_GIER_GIE6_MASK                        (0x40U)
#define MU_GIER_GIE6_SHIFT                       (6U)
/*! GIE6 - MUB General Purpose Interrupt Enable n
 *  0b0..Disables MUB General Interrupt n.
 *  0b1..Enables MUB General Interrupt n.
 */
#define MU_GIER_GIE6(x)                          (((uint32_t)(((uint32_t)(x)) << MU_GIER_GIE6_SHIFT)) & MU_GIER_GIE6_MASK)

#define MU_GIER_GIE7_MASK                        (0x80U)
#define MU_GIER_GIE7_SHIFT                       (7U)
/*! GIE7 - MUB General Purpose Interrupt Enable n
 *  0b0..Disables MUB General Interrupt n.
 *  0b1..Enables MUB General Interrupt n.
 */
#define MU_GIER_GIE7(x)                          (((uint32_t)(((uint32_t)(x)) << MU_GIER_GIE7_SHIFT)) & MU_GIER_GIE7_MASK)

#define MU_GIER_GIE8_MASK                        (0x100U)
#define MU_GIER_GIE8_SHIFT                       (8U)
/*! GIE8 - MUB General Purpose Interrupt Enable n
 *  0b0..Disables MUB General Interrupt n.
 *  0b1..Enables MUB General Interrupt n.
 */
#define MU_GIER_GIE8(x)                          (((uint32_t)(((uint32_t)(x)) << MU_GIER_GIE8_SHIFT)) & MU_GIER_GIE8_MASK)

#define MU_GIER_GIE9_MASK                        (0x200U)
#define MU_GIER_GIE9_SHIFT                       (9U)
/*! GIE9 - MUB General Purpose Interrupt Enable n
 *  0b0..Disables MUB General Interrupt n.
 *  0b1..Enables MUB General Interrupt n.
 */
#define MU_GIER_GIE9(x)                          (((uint32_t)(((uint32_t)(x)) << MU_GIER_GIE9_SHIFT)) & MU_GIER_GIE9_MASK)

#define MU_GIER_GIE10_MASK                       (0x400U)
#define MU_GIER_GIE10_SHIFT                      (10U)
/*! GIE10 - MUB General Purpose Interrupt Enable n
 *  0b0..Disables MUB General Interrupt n.
 *  0b1..Enables MUB General Interrupt n.
 */
#define MU_GIER_GIE10(x)                         (((uint32_t)(((uint32_t)(x)) << MU_GIER_GIE10_SHIFT)) & MU_GIER_GIE10_MASK)

#define MU_GIER_GIE11_MASK                       (0x800U)
#define MU_GIER_GIE11_SHIFT                      (11U)
/*! GIE11 - MUB General Purpose Interrupt Enable n
 *  0b0..Disables MUB General Interrupt n.
 *  0b1..Enables MUB General Interrupt n.
 */
#define MU_GIER_GIE11(x)                         (((uint32_t)(((uint32_t)(x)) << MU_GIER_GIE11_SHIFT)) & MU_GIER_GIE11_MASK)

