zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_MU.h
#define MU_GIER_GIE12_MASK                       (0x1000U)
#define MU_GIER_GIE12_SHIFT                      (12U)
/*! GIE12 - MUB General Purpose Interrupt Enable n
 *  0b0..Disables MUB General Interrupt n.
 *  0b1..Enables MUB General Interrupt n.
 */
#define MU_GIER_GIE12(x)                         (((uint32_t)(((uint32_t)(x)) << MU_GIER_GIE12_SHIFT)) & MU_GIER_GIE12_MASK)

#define MU_GIER_GIE13_MASK                       (0x2000U)
#define MU_GIER_GIE13_SHIFT                      (13U)
/*! GIE13 - MUB General Purpose Interrupt Enable n
 *  0b0..Disables MUB General Interrupt n.
 *  0b1..Enables MUB General Interrupt n.
 */
#define MU_GIER_GIE13(x)                         (((uint32_t)(((uint32_t)(x)) << MU_GIER_GIE13_SHIFT)) & MU_GIER_GIE13_MASK)

#define MU_GIER_GIE14_MASK                       (0x4000U)
#define MU_GIER_GIE14_SHIFT                      (14U)
/*! GIE14 - MUB General Purpose Interrupt Enable n
 *  0b0..Disables MUB General Interrupt n.
 *  0b1..Enables MUB General Interrupt n.
 */
#define MU_GIER_GIE14(x)                         (((uint32_t)(((uint32_t)(x)) << MU_GIER_GIE14_SHIFT)) & MU_GIER_GIE14_MASK)

#define MU_GIER_GIE15_MASK                       (0x8000U)
#define MU_GIER_GIE15_SHIFT                      (15U)
/*! GIE15 - MUB General Purpose Interrupt Enable n
 *  0b0..Disables MUB General Interrupt n.
 *  0b1..Enables MUB General Interrupt n.
 */
#define MU_GIER_GIE15(x)                         (((uint32_t)(((uint32_t)(x)) << MU_GIER_GIE15_SHIFT)) & MU_GIER_GIE15_MASK)

#define MU_GIER_GIE16_MASK                       (0x10000U)
#define MU_GIER_GIE16_SHIFT                      (16U)
/*! GIE16 - MUB General Purpose Interrupt Enable n
 *  0b0..Disables MUB General Interrupt n.
 *  0b1..Enables MUB General Interrupt n.
 */
#define MU_GIER_GIE16(x)                         (((uint32_t)(((uint32_t)(x)) << MU_GIER_GIE16_SHIFT)) & MU_GIER_GIE16_MASK)

#define MU_GIER_GIE17_MASK                       (0x20000U)
#define MU_GIER_GIE17_SHIFT                      (17U)
/*! GIE17 - MUB General Purpose Interrupt Enable n
 *  0b0..Disables MUB General Interrupt n.
 *  0b1..Enables MUB General Interrupt n.
 */
#define MU_GIER_GIE17(x)                         (((uint32_t)(((uint32_t)(x)) << MU_GIER_GIE17_SHIFT)) & MU_GIER_GIE17_MASK)

#define MU_GIER_GIE18_MASK                       (0x40000U)
#define MU_GIER_GIE18_SHIFT                      (18U)
/*! GIE18 - MUB General Purpose Interrupt Enable n
 *  0b0..Disables MUB General Interrupt n.
 *  0b1..Enables MUB General Interrupt n.
 */
#define MU_GIER_GIE18(x)                         (((uint32_t)(((uint32_t)(x)) << MU_GIER_GIE18_SHIFT)) & MU_GIER_GIE18_MASK)

#define MU_GIER_GIE19_MASK                       (0x80000U)
#define MU_GIER_GIE19_SHIFT                      (19U)
/*! GIE19 - MUB General Purpose Interrupt Enable n
 *  0b0..Disables MUB General Interrupt n.
 *  0b1..Enables MUB General Interrupt n.
 */
#define MU_GIER_GIE19(x)                         (((uint32_t)(((uint32_t)(x)) << MU_GIER_GIE19_SHIFT)) & MU_GIER_GIE19_MASK)

#define MU_GIER_GIE20_MASK                       (0x100000U)
#define MU_GIER_GIE20_SHIFT                      (20U)
/*! GIE20 - MUB General Purpose Interrupt Enable n
 *  0b0..Disables MUB General Interrupt n.
 *  0b1..Enables MUB General Interrupt n.
 */
#define MU_GIER_GIE20(x)                         (((uint32_t)(((uint32_t)(x)) << MU_GIER_GIE20_SHIFT)) & MU_GIER_GIE20_MASK)

#define MU_GIER_GIE21_MASK                       (0x200000U)
#define MU_GIER_GIE21_SHIFT                      (21U)
/*! GIE21 - MUB General Purpose Interrupt Enable n
 *  0b0..Disables MUB General Interrupt n.
 *  0b1..Enables MUB General Interrupt n.
 */
#define MU_GIER_GIE21(x)                         (((uint32_t)(((uint32_t)(x)) << MU_GIER_GIE21_SHIFT)) & MU_GIER_GIE21_MASK)

#define MU_GIER_GIE22_MASK                       (0x400000U)
#define MU_GIER_GIE22_SHIFT                      (22U)
/*! GIE22 - MUB General Purpose Interrupt Enable n
 *  0b0..Disables MUB General Interrupt n.
 *  0b1..Enables MUB General Interrupt n.
 */
#define MU_GIER_GIE22(x)                         (((uint32_t)(((uint32_t)(x)) << MU_GIER_GIE22_SHIFT)) & MU_GIER_GIE22_MASK)

#define MU_GIER_GIE23_MASK                       (0x800000U)
#define MU_GIER_GIE23_SHIFT                      (23U)
/*! GIE23 - MUB General Purpose Interrupt Enable n
 *  0b0..Disables MUB General Interrupt n.
 *  0b1..Enables MUB General Interrupt n.
 */
#define MU_GIER_GIE23(x)                         (((uint32_t)(((uint32_t)(x)) << MU_GIER_GIE23_SHIFT)) & MU_GIER_GIE23_MASK)

#define MU_GIER_GIE24_MASK                       (0x1000000U)
#define MU_GIER_GIE24_SHIFT                      (24U)
/*! GIE24 - MUB General Purpose Interrupt Enable n
 *  0b0..Disables MUB General Interrupt n.
 *  0b1..Enables MUB General Interrupt n.
 */
#define MU_GIER_GIE24(x)                         (((uint32_t)(((uint32_t)(x)) << MU_GIER_GIE24_SHIFT)) & MU_GIER_GIE24_MASK)

#define MU_GIER_GIE25_MASK                       (0x2000000U)
#define MU_GIER_GIE25_SHIFT                      (25U)
/*! GIE25 - MUB General Purpose Interrupt Enable n
 *  0b0..Disables MUB General Interrupt n.
 *  0b1..Enables MUB General Interrupt n.
 */
#define MU_GIER_GIE25(x)                         (((uint32_t)(((uint32_t)(x)) << MU_GIER_GIE25_SHIFT)) & MU_GIER_GIE25_MASK)

#define MU_GIER_GIE26_MASK                       (0x4000000U)
#define MU_GIER_GIE26_SHIFT                      (26U)
/*! GIE26 - MUB General Purpose Interrupt Enable n
 *  0b0..Disables MUB General Interrupt n.
 *  0b1..Enables MUB General Interrupt n.
 */
#define MU_GIER_GIE26(x)                         (((uint32_t)(((uint32_t)(x)) << MU_GIER_GIE26_SHIFT)) & MU_GIER_GIE26_MASK)

#define MU_GIER_GIE27_MASK                       (0x8000000U)
#define MU_GIER_GIE27_SHIFT                      (27U)
/*! GIE27 - MUB General Purpose Interrupt Enable n
 *  0b0..Disables MUB General Interrupt n.
 *  0b1..Enables MUB General Interrupt n.
 */
#define MU_GIER_GIE27(x)                         (((uint32_t)(((uint32_t)(x)) << MU_GIER_GIE27_SHIFT)) & MU_GIER_GIE27_MASK)

#define MU_GIER_GIE28_MASK                       (0x10000000U)
#define MU_GIER_GIE28_SHIFT                      (28U)
/*! GIE28 - MUB General Purpose Interrupt Enable n
 *  0b0..Disables MUB General Interrupt n.
 *  0b1..Enables MUB General Interrupt n.
 */
#define MU_GIER_GIE28(x)                         (((uint32_t)(((uint32_t)(x)) << MU_GIER_GIE28_SHIFT)) & MU_GIER_GIE28_MASK)

#define MU_GIER_GIE29_MASK                       (0x20000000U)
#define MU_GIER_GIE29_SHIFT                      (29U)
/*! GIE29 - MUB General Purpose Interrupt Enable n
 *  0b0..Disables MUB General Interrupt n.
 *  0b1..Enables MUB General Interrupt n.
 */
#define MU_GIER_GIE29(x)                         (((uint32_t)(((uint32_t)(x)) << MU_GIER_GIE29_SHIFT)) & MU_GIER_GIE29_MASK)

#define MU_GIER_GIE30_MASK                       (0x40000000U)
#define MU_GIER_GIE30_SHIFT                      (30U)
/*! GIE30 - MUB General Purpose Interrupt Enable n
 *  0b0..Disables MUB General Interrupt n.
 *  0b1..Enables MUB General Interrupt n.
 */
#define MU_GIER_GIE30(x)                         (((uint32_t)(((uint32_t)(x)) << MU_GIER_GIE30_SHIFT)) & MU_GIER_GIE30_MASK)

#define MU_GIER_GIE31_MASK                       (0x80000000U)
#define MU_GIER_GIE31_SHIFT                      (31U)
/*! GIE31 - MUB General Purpose Interrupt Enable n
 *  0b0..Disables MUB General Interrupt n.
 *  0b1..Enables MUB General Interrupt n.
 */
#define MU_GIER_GIE31(x)                         (((uint32_t)(((uint32_t)(x)) << MU_GIER_GIE31_SHIFT)) & MU_GIER_GIE31_MASK)
/*! @} */

/*! @name GCR - General Control Register */
/*! @{ */

#define MU_GCR_GIR0_MASK                         (0x1U)
#define MU_GCR_GIR0_SHIFT                        (0U)
/*! GIR0 - MUB General Purpose Interrupt Request n
 *  0b0..MUA General Interrupt n is not requested to the MUB.
 *  0b1..MUA General Interrupt n is requested to the MUB.
 */
#define MU_GCR_GIR0(x)                           (((uint32_t)(((uint32_t)(x)) << MU_GCR_GIR0_SHIFT)) & MU_GCR_GIR0_MASK)

#define MU_GCR_GIR1_MASK                         (0x2U)
#define MU_GCR_GIR1_SHIFT                        (1U)
/*! GIR1 - MUB General Purpose Interrupt Request n
 *  0b0..MUB General Interrupt n is not requested to the MUA.
 *  0b1..MUB General Interrupt n is requested to the MUA.
 */
#define MU_GCR_GIR1(x)                           (((uint32_t)(((uint32_t)(x)) << MU_GCR_GIR1_SHIFT)) & MU_GCR_GIR1_MASK)

#define MU_GCR_GIR2_MASK                         (0x4U)
#define MU_GCR_GIR2_SHIFT                        (2U)
/*! GIR2 - MUB General Purpose Interrupt Request n
 *  0b0..MUB General Interrupt n is not requested to the MUA.
 *  0b1..MUB General Interrupt n is requested to the MUA.
 */
#define MU_GCR_GIR2(x)                           (((uint32_t)(((uint32_t)(x)) << MU_GCR_GIR2_SHIFT)) & MU_GCR_GIR2_MASK)

#define MU_GCR_GIR3_MASK                         (0x8U)
#define MU_GCR_GIR3_SHIFT                        (3U)
/*! GIR3 - MUB General Purpose Interrupt Request n
 *  0b0..MUB General Interrupt n is not requested to the MUA.
 *  0b1..MUB General Interrupt n is requested to the MUA.
 */
#define MU_GCR_GIR3(x)                           (((uint32_t)(((uint32_t)(x)) << MU_GCR_GIR3_SHIFT)) & MU_GCR_GIR3_MASK)

#define MU_GCR_GIR4_MASK                         (0x10U)
#define MU_GCR_GIR4_SHIFT                        (4U)
/*! GIR4 - MUB General Purpose Interrupt Request n
 *  0b0..MUB General Interrupt n is not requested to the MUA.
 *  0b1..MUB General Interrupt n is requested to the MUA.
 */
#define MU_GCR_GIR4(x)                           (((uint32_t)(((uint32_t)(x)) << MU_GCR_GIR4_SHIFT)) & MU_GCR_GIR4_MASK)

#define MU_GCR_GIR5_MASK                         (0x20U)
#define MU_GCR_GIR5_SHIFT                        (5U)
/*! GIR5 - MUB General Purpose Interrupt Request n
 *  0b0..MUB General Interrupt n is not requested to the MUA.
 *  0b1..MUB General Interrupt n is requested to the MUA.
 */
#define MU_GCR_GIR5(x)                           (((uint32_t)(((uint32_t)(x)) << MU_GCR_GIR5_SHIFT)) & MU_GCR_GIR5_MASK)

