zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_MU.h
#define MU_GCR_GIR6_MASK                         (0x40U)
#define MU_GCR_GIR6_SHIFT                        (6U)
/*! GIR6 - MUB General Purpose Interrupt Request n
 *  0b0..MUB General Interrupt n is not requested to the MUA.
 *  0b1..MUB General Interrupt n is requested to the MUA.
 */
#define MU_GCR_GIR6(x)                           (((uint32_t)(((uint32_t)(x)) << MU_GCR_GIR6_SHIFT)) & MU_GCR_GIR6_MASK)

#define MU_GCR_GIR7_MASK                         (0x80U)
#define MU_GCR_GIR7_SHIFT                        (7U)
/*! GIR7 - MUB General Purpose Interrupt Request n
 *  0b0..MUB General Interrupt n is not requested to the MUA.
 *  0b1..MUB General Interrupt n is requested to the MUA.
 */
#define MU_GCR_GIR7(x)                           (((uint32_t)(((uint32_t)(x)) << MU_GCR_GIR7_SHIFT)) & MU_GCR_GIR7_MASK)

#define MU_GCR_GIR8_MASK                         (0x100U)
#define MU_GCR_GIR8_SHIFT                        (8U)
/*! GIR8 - MUB General Purpose Interrupt Request n
 *  0b0..MUB General Interrupt n is not requested to the MUA.
 *  0b1..MUB General Interrupt n is requested to the MUA.
 */
#define MU_GCR_GIR8(x)                           (((uint32_t)(((uint32_t)(x)) << MU_GCR_GIR8_SHIFT)) & MU_GCR_GIR8_MASK)

#define MU_GCR_GIR9_MASK                         (0x200U)
#define MU_GCR_GIR9_SHIFT                        (9U)
/*! GIR9 - MUB General Purpose Interrupt Request n
 *  0b0..MUB General Interrupt n is not requested to the MUA.
 *  0b1..MUB General Interrupt n is requested to the MUA.
 */
#define MU_GCR_GIR9(x)                           (((uint32_t)(((uint32_t)(x)) << MU_GCR_GIR9_SHIFT)) & MU_GCR_GIR9_MASK)

#define MU_GCR_GIR10_MASK                        (0x400U)
#define MU_GCR_GIR10_SHIFT                       (10U)
/*! GIR10 - MUB General Purpose Interrupt Request n
 *  0b0..MUB General Interrupt n is not requested to the MUA.
 *  0b1..MUB General Interrupt n is requested to the MUA.
 */
#define MU_GCR_GIR10(x)                          (((uint32_t)(((uint32_t)(x)) << MU_GCR_GIR10_SHIFT)) & MU_GCR_GIR10_MASK)

#define MU_GCR_GIR11_MASK                        (0x800U)
#define MU_GCR_GIR11_SHIFT                       (11U)
/*! GIR11 - MUB General Purpose Interrupt Request n
 *  0b0..MUB General Interrupt n is not requested to the MUA.
 *  0b1..MUB General Interrupt n is requested to the MUA.
 */
#define MU_GCR_GIR11(x)                          (((uint32_t)(((uint32_t)(x)) << MU_GCR_GIR11_SHIFT)) & MU_GCR_GIR11_MASK)

#define MU_GCR_GIR12_MASK                        (0x1000U)
#define MU_GCR_GIR12_SHIFT                       (12U)
/*! GIR12 - MUB General Purpose Interrupt Request n
 *  0b0..MUB General Interrupt n is not requested to the MUA.
 *  0b1..MUB General Interrupt n is requested to the MUA.
 */
#define MU_GCR_GIR12(x)                          (((uint32_t)(((uint32_t)(x)) << MU_GCR_GIR12_SHIFT)) & MU_GCR_GIR12_MASK)

#define MU_GCR_GIR13_MASK                        (0x2000U)
#define MU_GCR_GIR13_SHIFT                       (13U)
/*! GIR13 - MUB General Purpose Interrupt Request n
 *  0b0..MUB General Interrupt n is not requested to the MUA.
 *  0b1..MUB General Interrupt n is requested to the MUA.
 */
#define MU_GCR_GIR13(x)                          (((uint32_t)(((uint32_t)(x)) << MU_GCR_GIR13_SHIFT)) & MU_GCR_GIR13_MASK)

#define MU_GCR_GIR14_MASK                        (0x4000U)
#define MU_GCR_GIR14_SHIFT                       (14U)
/*! GIR14 - MUB General Purpose Interrupt Request n
 *  0b0..MUB General Interrupt n is not requested to the MUA.
 *  0b1..MUB General Interrupt n is requested to the MUA.
 */
#define MU_GCR_GIR14(x)                          (((uint32_t)(((uint32_t)(x)) << MU_GCR_GIR14_SHIFT)) & MU_GCR_GIR14_MASK)

#define MU_GCR_GIR15_MASK                        (0x8000U)
#define MU_GCR_GIR15_SHIFT                       (15U)
/*! GIR15 - MUB General Purpose Interrupt Request n
 *  0b0..MUB General Interrupt n is not requested to the MUA.
 *  0b1..MUB General Interrupt n is requested to the MUA.
 */
#define MU_GCR_GIR15(x)                          (((uint32_t)(((uint32_t)(x)) << MU_GCR_GIR15_SHIFT)) & MU_GCR_GIR15_MASK)

#define MU_GCR_GIR16_MASK                        (0x10000U)
#define MU_GCR_GIR16_SHIFT                       (16U)
/*! GIR16 - MUB General Purpose Interrupt Request n
 *  0b0..MUB General Interrupt n is not requested to the MUA.
 *  0b1..MUB General Interrupt n is requested to the MUA.
 */
#define MU_GCR_GIR16(x)                          (((uint32_t)(((uint32_t)(x)) << MU_GCR_GIR16_SHIFT)) & MU_GCR_GIR16_MASK)

#define MU_GCR_GIR17_MASK                        (0x20000U)
#define MU_GCR_GIR17_SHIFT                       (17U)
/*! GIR17 - MUB General Purpose Interrupt Request n
 *  0b0..MUB General Interrupt n is not requested to the MUA.
 *  0b1..MUB General Interrupt n is requested to the MUA.
 */
#define MU_GCR_GIR17(x)                          (((uint32_t)(((uint32_t)(x)) << MU_GCR_GIR17_SHIFT)) & MU_GCR_GIR17_MASK)

#define MU_GCR_GIR18_MASK                        (0x40000U)
#define MU_GCR_GIR18_SHIFT                       (18U)
/*! GIR18 - MUB General Purpose Interrupt Request n
 *  0b0..MUB General Interrupt n is not requested to the MUA.
 *  0b1..MUB General Interrupt n is requested to the MUA.
 */
#define MU_GCR_GIR18(x)                          (((uint32_t)(((uint32_t)(x)) << MU_GCR_GIR18_SHIFT)) & MU_GCR_GIR18_MASK)

#define MU_GCR_GIR19_MASK                        (0x80000U)
#define MU_GCR_GIR19_SHIFT                       (19U)
/*! GIR19 - MUB General Purpose Interrupt Request n
 *  0b0..MUB General Interrupt n is not requested to the MUA.
 *  0b1..MUB General Interrupt n is requested to the MUA.
 */
#define MU_GCR_GIR19(x)                          (((uint32_t)(((uint32_t)(x)) << MU_GCR_GIR19_SHIFT)) & MU_GCR_GIR19_MASK)

#define MU_GCR_GIR20_MASK                        (0x100000U)
#define MU_GCR_GIR20_SHIFT                       (20U)
/*! GIR20 - MUB General Purpose Interrupt Request n
 *  0b0..MUB General Interrupt n is not requested to the MUA.
 *  0b1..MUB General Interrupt n is requested to the MUA.
 */
#define MU_GCR_GIR20(x)                          (((uint32_t)(((uint32_t)(x)) << MU_GCR_GIR20_SHIFT)) & MU_GCR_GIR20_MASK)

