zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_MU.h
#define MU_GCR_GIR21_MASK                        (0x200000U)
#define MU_GCR_GIR21_SHIFT                       (21U)
/*! GIR21 - MUB General Purpose Interrupt Request n
 *  0b0..MUB General Interrupt n is not requested to the MUA.
 *  0b1..MUB General Interrupt n is requested to the MUA.
 */
#define MU_GCR_GIR21(x)                          (((uint32_t)(((uint32_t)(x)) << MU_GCR_GIR21_SHIFT)) & MU_GCR_GIR21_MASK)

#define MU_GCR_GIR22_MASK                        (0x400000U)
#define MU_GCR_GIR22_SHIFT                       (22U)
/*! GIR22 - MUB General Purpose Interrupt Request n
 *  0b0..MUB General Interrupt n is not requested to the MUA.
 *  0b1..MUB General Interrupt n is requested to the MUA.
 */
#define MU_GCR_GIR22(x)                          (((uint32_t)(((uint32_t)(x)) << MU_GCR_GIR22_SHIFT)) & MU_GCR_GIR22_MASK)

#define MU_GCR_GIR23_MASK                        (0x800000U)
#define MU_GCR_GIR23_SHIFT                       (23U)
/*! GIR23 - MUB General Purpose Interrupt Request n
 *  0b0..MUB General Interrupt n is not requested to the MUA.
 *  0b1..MUB General Interrupt n is requested to the MUA.
 */
#define MU_GCR_GIR23(x)                          (((uint32_t)(((uint32_t)(x)) << MU_GCR_GIR23_SHIFT)) & MU_GCR_GIR23_MASK)

#define MU_GCR_GIR24_MASK                        (0x1000000U)
#define MU_GCR_GIR24_SHIFT                       (24U)
/*! GIR24 - MUB General Purpose Interrupt Request n
 *  0b0..MUB General Interrupt n is not requested to the MUA.
 *  0b1..MUB General Interrupt n is requested to the MUA.
 */
#define MU_GCR_GIR24(x)                          (((uint32_t)(((uint32_t)(x)) << MU_GCR_GIR24_SHIFT)) & MU_GCR_GIR24_MASK)

#define MU_GCR_GIR25_MASK                        (0x2000000U)
#define MU_GCR_GIR25_SHIFT                       (25U)
/*! GIR25 - MUB General Purpose Interrupt Request n
 *  0b0..MUB General Interrupt n is not requested to the MUA.
 *  0b1..MUB General Interrupt n is requested to the MUA.
 */
#define MU_GCR_GIR25(x)                          (((uint32_t)(((uint32_t)(x)) << MU_GCR_GIR25_SHIFT)) & MU_GCR_GIR25_MASK)

#define MU_GCR_GIR26_MASK                        (0x4000000U)
#define MU_GCR_GIR26_SHIFT                       (26U)
/*! GIR26 - MUB General Purpose Interrupt Request n
 *  0b0..MUB General Interrupt n is not requested to the MUA.
 *  0b1..MUB General Interrupt n is requested to the MUA.
 */
#define MU_GCR_GIR26(x)                          (((uint32_t)(((uint32_t)(x)) << MU_GCR_GIR26_SHIFT)) & MU_GCR_GIR26_MASK)

#define MU_GCR_GIR27_MASK                        (0x8000000U)
#define MU_GCR_GIR27_SHIFT                       (27U)
/*! GIR27 - MUB General Purpose Interrupt Request n
 *  0b0..MUB General Interrupt n is not requested to the MUA.
 *  0b1..MUB General Interrupt n is requested to the MUA.
 */
#define MU_GCR_GIR27(x)                          (((uint32_t)(((uint32_t)(x)) << MU_GCR_GIR27_SHIFT)) & MU_GCR_GIR27_MASK)

#define MU_GCR_GIR28_MASK                        (0x10000000U)
#define MU_GCR_GIR28_SHIFT                       (28U)
/*! GIR28 - MUB General Purpose Interrupt Request n
 *  0b0..MUB General Interrupt n is not requested to the MUA.
 *  0b1..MUB General Interrupt n is requested to the MUA.
 */
#define MU_GCR_GIR28(x)                          (((uint32_t)(((uint32_t)(x)) << MU_GCR_GIR28_SHIFT)) & MU_GCR_GIR28_MASK)

#define MU_GCR_GIR29_MASK                        (0x20000000U)
#define MU_GCR_GIR29_SHIFT                       (29U)
/*! GIR29 - MUB General Purpose Interrupt Request n
 *  0b0..MUB General Interrupt n is not requested to the MUA.
 *  0b1..MUB General Interrupt n is requested to the MUA.
 */
#define MU_GCR_GIR29(x)                          (((uint32_t)(((uint32_t)(x)) << MU_GCR_GIR29_SHIFT)) & MU_GCR_GIR29_MASK)

#define MU_GCR_GIR30_MASK                        (0x40000000U)
#define MU_GCR_GIR30_SHIFT                       (30U)
/*! GIR30 - MUB General Purpose Interrupt Request n
 *  0b0..MUB General Interrupt n is not requested to the MUA.
 *  0b1..MUB General Interrupt n is requested to the MUA.
 */
#define MU_GCR_GIR30(x)                          (((uint32_t)(((uint32_t)(x)) << MU_GCR_GIR30_SHIFT)) & MU_GCR_GIR30_MASK)

#define MU_GCR_GIR31_MASK                        (0x80000000U)
#define MU_GCR_GIR31_SHIFT                       (31U)
/*! GIR31 - MUB General Purpose Interrupt Request n
 *  0b0..MUB General Interrupt n is not requested to the MUA.
 *  0b1..MUB General Interrupt n is requested to the MUA.
 */
#define MU_GCR_GIR31(x)                          (((uint32_t)(((uint32_t)(x)) << MU_GCR_GIR31_SHIFT)) & MU_GCR_GIR31_MASK)
/*! @} */

/*! @name GSR - General Status Register */
/*! @{ */

#define MU_GSR_GIP0_MASK                         (0x1U)
#define MU_GSR_GIP0_SHIFT                        (0U)
/*! GIP0 - MUB General Interrupt Request Pending n
 *  0b0..MUA general purpose interrupt n is not pending.
 *  0b1..MUA general purpose interrupt n is pending.
 */
#define MU_GSR_GIP0(x)                           (((uint32_t)(((uint32_t)(x)) << MU_GSR_GIP0_SHIFT)) & MU_GSR_GIP0_MASK)

#define MU_GSR_GIP1_MASK                         (0x2U)
#define MU_GSR_GIP1_SHIFT                        (1U)
/*! GIP1 - MUB General Interrupt Request Pending n
 *  0b0..MUB general purpose interrupt n is not pending.
 *  0b1..MUB general purpose interrupt n is pending.
 */
#define MU_GSR_GIP1(x)                           (((uint32_t)(((uint32_t)(x)) << MU_GSR_GIP1_SHIFT)) & MU_GSR_GIP1_MASK)

#define MU_GSR_GIP2_MASK                         (0x4U)
#define MU_GSR_GIP2_SHIFT                        (2U)
/*! GIP2 - MUB General Interrupt Request Pending n
 *  0b0..MUB general purpose interrupt n is not pending.
 *  0b1..MUB general purpose interrupt n is pending.
 */
#define MU_GSR_GIP2(x)                           (((uint32_t)(((uint32_t)(x)) << MU_GSR_GIP2_SHIFT)) & MU_GSR_GIP2_MASK)

#define MU_GSR_GIP3_MASK                         (0x8U)
#define MU_GSR_GIP3_SHIFT                        (3U)
/*! GIP3 - MUB General Interrupt Request Pending n
 *  0b0..MUB general purpose interrupt n is not pending.
 *  0b1..MUB general purpose interrupt n is pending.
 */
#define MU_GSR_GIP3(x)                           (((uint32_t)(((uint32_t)(x)) << MU_GSR_GIP3_SHIFT)) & MU_GSR_GIP3_MASK)

#define MU_GSR_GIP4_MASK                         (0x10U)
#define MU_GSR_GIP4_SHIFT                        (4U)
/*! GIP4 - MUB General Interrupt Request Pending n
 *  0b0..MUB general purpose interrupt n is not pending.
 *  0b1..MUB general purpose interrupt n is pending.
 */
#define MU_GSR_GIP4(x)                           (((uint32_t)(((uint32_t)(x)) << MU_GSR_GIP4_SHIFT)) & MU_GSR_GIP4_MASK)

#define MU_GSR_GIP5_MASK                         (0x20U)
#define MU_GSR_GIP5_SHIFT                        (5U)
/*! GIP5 - MUB General Interrupt Request Pending n
 *  0b0..MUB general purpose interrupt n is not pending.
 *  0b1..MUB general purpose interrupt n is pending.
 */
#define MU_GSR_GIP5(x)                           (((uint32_t)(((uint32_t)(x)) << MU_GSR_GIP5_SHIFT)) & MU_GSR_GIP5_MASK)

#define MU_GSR_GIP6_MASK                         (0x40U)
#define MU_GSR_GIP6_SHIFT                        (6U)
/*! GIP6 - MUB General Interrupt Request Pending n
 *  0b0..MUB general purpose interrupt n is not pending.
 *  0b1..MUB general purpose interrupt n is pending.
 */
#define MU_GSR_GIP6(x)                           (((uint32_t)(((uint32_t)(x)) << MU_GSR_GIP6_SHIFT)) & MU_GSR_GIP6_MASK)

#define MU_GSR_GIP7_MASK                         (0x80U)
#define MU_GSR_GIP7_SHIFT                        (7U)
/*! GIP7 - MUB General Interrupt Request Pending n
 *  0b0..MUB general purpose interrupt n is not pending.
 *  0b1..MUB general purpose interrupt n is pending.
 */
#define MU_GSR_GIP7(x)                           (((uint32_t)(((uint32_t)(x)) << MU_GSR_GIP7_SHIFT)) & MU_GSR_GIP7_MASK)

#define MU_GSR_GIP8_MASK                         (0x100U)
#define MU_GSR_GIP8_SHIFT                        (8U)
/*! GIP8 - MUB General Interrupt Request Pending n
 *  0b0..MUB general purpose interrupt n is not pending.
 *  0b1..MUB general purpose interrupt n is pending.
 */
#define MU_GSR_GIP8(x)                           (((uint32_t)(((uint32_t)(x)) << MU_GSR_GIP8_SHIFT)) & MU_GSR_GIP8_MASK)

#define MU_GSR_GIP9_MASK                         (0x200U)
#define MU_GSR_GIP9_SHIFT                        (9U)
/*! GIP9 - MUB General Interrupt Request Pending n
 *  0b0..MUB general purpose interrupt n is not pending.
 *  0b1..MUB general purpose interrupt n is pending.
 */
#define MU_GSR_GIP9(x)                           (((uint32_t)(((uint32_t)(x)) << MU_GSR_GIP9_SHIFT)) & MU_GSR_GIP9_MASK)

#define MU_GSR_GIP10_MASK                        (0x400U)
#define MU_GSR_GIP10_SHIFT                       (10U)
/*! GIP10 - MUB General Interrupt Request Pending n
 *  0b0..MUB general purpose interrupt n is not pending.
 *  0b1..MUB general purpose interrupt n is pending.
 */
#define MU_GSR_GIP10(x)                          (((uint32_t)(((uint32_t)(x)) << MU_GSR_GIP10_SHIFT)) & MU_GSR_GIP10_MASK)

#define MU_GSR_GIP11_MASK                        (0x800U)
#define MU_GSR_GIP11_SHIFT                       (11U)
/*! GIP11 - MUB General Interrupt Request Pending n
 *  0b0..MUB general purpose interrupt n is not pending.
 *  0b1..MUB general purpose interrupt n is pending.
 */
#define MU_GSR_GIP11(x)                          (((uint32_t)(((uint32_t)(x)) << MU_GSR_GIP11_SHIFT)) & MU_GSR_GIP11_MASK)

