zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_MU.h
#define MU_GSR_GIP12_MASK                        (0x1000U)
#define MU_GSR_GIP12_SHIFT                       (12U)
/*! GIP12 - MUB General Interrupt Request Pending n
 *  0b0..MUB general purpose interrupt n is not pending.
 *  0b1..MUB general purpose interrupt n is pending.
 */
#define MU_GSR_GIP12(x)                          (((uint32_t)(((uint32_t)(x)) << MU_GSR_GIP12_SHIFT)) & MU_GSR_GIP12_MASK)

#define MU_GSR_GIP13_MASK                        (0x2000U)
#define MU_GSR_GIP13_SHIFT                       (13U)
/*! GIP13 - MUB General Interrupt Request Pending n
 *  0b0..MUB general purpose interrupt n is not pending.
 *  0b1..MUB general purpose interrupt n is pending.
 */
#define MU_GSR_GIP13(x)                          (((uint32_t)(((uint32_t)(x)) << MU_GSR_GIP13_SHIFT)) & MU_GSR_GIP13_MASK)

#define MU_GSR_GIP14_MASK                        (0x4000U)
#define MU_GSR_GIP14_SHIFT                       (14U)
/*! GIP14 - MUB General Interrupt Request Pending n
 *  0b0..MUB general purpose interrupt n is not pending.
 *  0b1..MUB general purpose interrupt n is pending.
 */
#define MU_GSR_GIP14(x)                          (((uint32_t)(((uint32_t)(x)) << MU_GSR_GIP14_SHIFT)) & MU_GSR_GIP14_MASK)

#define MU_GSR_GIP15_MASK                        (0x8000U)
#define MU_GSR_GIP15_SHIFT                       (15U)
/*! GIP15 - MUB General Interrupt Request Pending n
 *  0b0..MUB general purpose interrupt n is not pending.
 *  0b1..MUB general purpose interrupt n is pending.
 */
#define MU_GSR_GIP15(x)                          (((uint32_t)(((uint32_t)(x)) << MU_GSR_GIP15_SHIFT)) & MU_GSR_GIP15_MASK)

#define MU_GSR_GIP16_MASK                        (0x10000U)
#define MU_GSR_GIP16_SHIFT                       (16U)
/*! GIP16 - MUB General Interrupt Request Pending n
 *  0b0..MUB general purpose interrupt n is not pending.
 *  0b1..MUB general purpose interrupt n is pending.
 */
#define MU_GSR_GIP16(x)                          (((uint32_t)(((uint32_t)(x)) << MU_GSR_GIP16_SHIFT)) & MU_GSR_GIP16_MASK)

#define MU_GSR_GIP17_MASK                        (0x20000U)
#define MU_GSR_GIP17_SHIFT                       (17U)
/*! GIP17 - MUB General Interrupt Request Pending n
 *  0b0..MUB general purpose interrupt n is not pending.
 *  0b1..MUB general purpose interrupt n is pending.
 */
#define MU_GSR_GIP17(x)                          (((uint32_t)(((uint32_t)(x)) << MU_GSR_GIP17_SHIFT)) & MU_GSR_GIP17_MASK)

#define MU_GSR_GIP18_MASK                        (0x40000U)
#define MU_GSR_GIP18_SHIFT                       (18U)
/*! GIP18 - MUB General Interrupt Request Pending n
 *  0b0..MUB general purpose interrupt n is not pending.
 *  0b1..MUB general purpose interrupt n is pending.
 */
#define MU_GSR_GIP18(x)                          (((uint32_t)(((uint32_t)(x)) << MU_GSR_GIP18_SHIFT)) & MU_GSR_GIP18_MASK)

#define MU_GSR_GIP19_MASK                        (0x80000U)
#define MU_GSR_GIP19_SHIFT                       (19U)
/*! GIP19 - MUB General Interrupt Request Pending n
 *  0b0..MUB general purpose interrupt n is not pending.
 *  0b1..MUB general purpose interrupt n is pending.
 */
#define MU_GSR_GIP19(x)                          (((uint32_t)(((uint32_t)(x)) << MU_GSR_GIP19_SHIFT)) & MU_GSR_GIP19_MASK)

#define MU_GSR_GIP20_MASK                        (0x100000U)
#define MU_GSR_GIP20_SHIFT                       (20U)
/*! GIP20 - MUB General Interrupt Request Pending n
 *  0b0..MUB general purpose interrupt n is not pending.
 *  0b1..MUB general purpose interrupt n is pending.
 */
#define MU_GSR_GIP20(x)                          (((uint32_t)(((uint32_t)(x)) << MU_GSR_GIP20_SHIFT)) & MU_GSR_GIP20_MASK)

#define MU_GSR_GIP21_MASK                        (0x200000U)
#define MU_GSR_GIP21_SHIFT                       (21U)
/*! GIP21 - MUB General Interrupt Request Pending n
 *  0b0..MUB general purpose interrupt n is not pending.
 *  0b1..MUB general purpose interrupt n is pending.
 */
#define MU_GSR_GIP21(x)                          (((uint32_t)(((uint32_t)(x)) << MU_GSR_GIP21_SHIFT)) & MU_GSR_GIP21_MASK)

#define MU_GSR_GIP22_MASK                        (0x400000U)
#define MU_GSR_GIP22_SHIFT                       (22U)
/*! GIP22 - MUB General Interrupt Request Pending n
 *  0b0..MUB general purpose interrupt n is not pending.
 *  0b1..MUB general purpose interrupt n is pending.
 */
#define MU_GSR_GIP22(x)                          (((uint32_t)(((uint32_t)(x)) << MU_GSR_GIP22_SHIFT)) & MU_GSR_GIP22_MASK)

#define MU_GSR_GIP23_MASK                        (0x800000U)
#define MU_GSR_GIP23_SHIFT                       (23U)
/*! GIP23 - MUB General Interrupt Request Pending n
 *  0b0..MUB general purpose interrupt n is not pending.
 *  0b1..MUB general purpose interrupt n is pending.
 */
#define MU_GSR_GIP23(x)                          (((uint32_t)(((uint32_t)(x)) << MU_GSR_GIP23_SHIFT)) & MU_GSR_GIP23_MASK)

#define MU_GSR_GIP24_MASK                        (0x1000000U)
#define MU_GSR_GIP24_SHIFT                       (24U)
/*! GIP24 - MUB General Interrupt Request Pending n
 *  0b0..MUB general purpose interrupt n is not pending.
 *  0b1..MUB general purpose interrupt n is pending.
 */
#define MU_GSR_GIP24(x)                          (((uint32_t)(((uint32_t)(x)) << MU_GSR_GIP24_SHIFT)) & MU_GSR_GIP24_MASK)

#define MU_GSR_GIP25_MASK                        (0x2000000U)
#define MU_GSR_GIP25_SHIFT                       (25U)
/*! GIP25 - MUB General Interrupt Request Pending n
 *  0b0..MUB general purpose interrupt n is not pending.
 *  0b1..MUB general purpose interrupt n is pending.
 */
#define MU_GSR_GIP25(x)                          (((uint32_t)(((uint32_t)(x)) << MU_GSR_GIP25_SHIFT)) & MU_GSR_GIP25_MASK)

#define MU_GSR_GIP26_MASK                        (0x4000000U)
#define MU_GSR_GIP26_SHIFT                       (26U)
/*! GIP26 - MUB General Interrupt Request Pending n
 *  0b0..MUB general purpose interrupt n is not pending.
 *  0b1..MUB general purpose interrupt n is pending.
 */
#define MU_GSR_GIP26(x)                          (((uint32_t)(((uint32_t)(x)) << MU_GSR_GIP26_SHIFT)) & MU_GSR_GIP26_MASK)

#define MU_GSR_GIP27_MASK                        (0x8000000U)
#define MU_GSR_GIP27_SHIFT                       (27U)
/*! GIP27 - MUB General Interrupt Request Pending n
 *  0b0..MUB general purpose interrupt n is not pending.
 *  0b1..MUB general purpose interrupt n is pending.
 */
#define MU_GSR_GIP27(x)                          (((uint32_t)(((uint32_t)(x)) << MU_GSR_GIP27_SHIFT)) & MU_GSR_GIP27_MASK)

#define MU_GSR_GIP28_MASK                        (0x10000000U)
#define MU_GSR_GIP28_SHIFT                       (28U)
/*! GIP28 - MUB General Interrupt Request Pending n
 *  0b0..MUB general purpose interrupt n is not pending.
 *  0b1..MUB general purpose interrupt n is pending.
 */
#define MU_GSR_GIP28(x)                          (((uint32_t)(((uint32_t)(x)) << MU_GSR_GIP28_SHIFT)) & MU_GSR_GIP28_MASK)

#define MU_GSR_GIP29_MASK                        (0x20000000U)
#define MU_GSR_GIP29_SHIFT                       (29U)
/*! GIP29 - MUB General Interrupt Request Pending n
 *  0b0..MUB general purpose interrupt n is not pending.
 *  0b1..MUB general purpose interrupt n is pending.
 */
#define MU_GSR_GIP29(x)                          (((uint32_t)(((uint32_t)(x)) << MU_GSR_GIP29_SHIFT)) & MU_GSR_GIP29_MASK)

#define MU_GSR_GIP30_MASK                        (0x40000000U)
#define MU_GSR_GIP30_SHIFT                       (30U)
/*! GIP30 - MUB General Interrupt Request Pending n
 *  0b0..MUB general purpose interrupt n is not pending.
 *  0b1..MUB general purpose interrupt n is pending.
 */
#define MU_GSR_GIP30(x)                          (((uint32_t)(((uint32_t)(x)) << MU_GSR_GIP30_SHIFT)) & MU_GSR_GIP30_MASK)

#define MU_GSR_GIP31_MASK                        (0x80000000U)
#define MU_GSR_GIP31_SHIFT                       (31U)
/*! GIP31 - MUB General Interrupt Request Pending n
 *  0b0..MUB general purpose interrupt n is not pending.
 *  0b1..MUB general purpose interrupt n is pending.
 */
#define MU_GSR_GIP31(x)                          (((uint32_t)(((uint32_t)(x)) << MU_GSR_GIP31_SHIFT)) & MU_GSR_GIP31_MASK)
/*! @} */

/*! @name TCR - Transmit Control Register */
/*! @{ */

#define MU_TCR_TIE0_MASK                         (0x1U)
#define MU_TCR_TIE0_SHIFT                        (0U)
/*! TIE0 - MUB Transmit Interrupt Enable n
 *  0b0..Disables MUA Transmit Interrupt n. (default)
 *  0b1..Enables MUA Transmit Interrupt n.
 */
#define MU_TCR_TIE0(x)                           (((uint32_t)(((uint32_t)(x)) << MU_TCR_TIE0_SHIFT)) & MU_TCR_TIE0_MASK)

#define MU_TCR_TIE1_MASK                         (0x2U)
#define MU_TCR_TIE1_SHIFT                        (1U)
/*! TIE1 - MUB Transmit Interrupt Enable n
 *  0b0..Disables MUA Transmit Interrupt n. (default)
 *  0b1..Enables MUA Transmit Interrupt n.
 */
#define MU_TCR_TIE1(x)                           (((uint32_t)(((uint32_t)(x)) << MU_TCR_TIE1_SHIFT)) & MU_TCR_TIE1_MASK)

#define MU_TCR_TIE2_MASK                         (0x4U)
#define MU_TCR_TIE2_SHIFT                        (2U)
/*! TIE2 - MUB Transmit Interrupt Enable n
 *  0b0..Disables MUA Transmit Interrupt n. (default)
 *  0b1..Enables MUA Transmit Interrupt n.
 */
#define MU_TCR_TIE2(x)                           (((uint32_t)(((uint32_t)(x)) << MU_TCR_TIE2_SHIFT)) & MU_TCR_TIE2_MASK)

